Examinator/src/InformationRegisters/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяПрохожденияВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистратора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/НазначенияТестированийСУЗ/НазначенияТестированийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияТестированийСУЗ</name>
  <enumValues>
    <name>Аттестация</name>
  </enumValues>
  <enumValues>
    <name>Упражнение</name>
  </enumValues>
  <enumValues>
    <name>Анкетирование</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПрохождениеОбученияСУО/ПрохождениеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеОбученияСУО</name>
  <registerRecords>InformationRegister.РасписаниеОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ФайлыНаПроверкуПреподавателюСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ОценкиКачестваОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачестваОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКачестваОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОцениванияКачестваОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/СессияЭлектронногоРесурсаСУЗ/СессияЭлектронногоРесурсаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СессияЭлектронногоРесурсаСУЗ</name>
  <registerRecords>InformationRegister.ТестыНаПроверкуСУЗ</registerRecords>
  <registerRecords>InformationRegister.ОтветыНаВопросыСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВопросыТестированийСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВыбранныеВариантыОтветовВопросовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяСессия</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСессии</name>
    <type>
      <types>EnumRef.ТипыСессийЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТекстовые</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияИзменений</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеТекстовые</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

Функция ПопыткиПрохожденияТестов(Пользователь, ПрохождениеОбучения, ПрисоединенныеЭлектронныеКурсы) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = "";
	
	Если ПрохождениеОбучения <> Неопределено Тогда
	
		Запрос.Текст = Запрос.Текст + 
			"ВЫБРАТЬ
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Период КАК Дата,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Результат,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ВыставляетсяОценка,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверяетсяПреподавателем,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверенПреподавателем,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ДатаНачалаПрохождения,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ДатаОкончанияПрохождения,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Регистратор КАК СессияВыполненияТеста,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания.Наименование КАК НаименованиеЭлементаСодержания,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс.Наименование КАК НаименованиеЭлектронногоРесурса
			|ИЗ
			|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
			|ГДЕ
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Пользователь = &Пользователь
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭтоТест = ИСТИНА
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткаЗавершена = ИСТИНА
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.СсылкаНаОбъектСУЗ.НазначениеТестирования <> &НазначениеТестированияАнкетирование";	
		
		Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
		Запрос.УстановитьПараметр("НазначениеТестированияАнкетирование", Перечисления.НазначенияТестированийСУЗ.Анкетирование);
		
	КонецЕсли;
	
	Если ПрисоединенныеЭлектронныеКурсы.Количество() > 0 Тогда
		
		Если ПрохождениеОбучения <> Неопределено Тогда
			
			Запрос.Текст = Запрос.Текст + " ОБЪЕДИНИТЬ ";
			
			// Используется именно ОБЪЕДИНИТЬ, а не ОБЪЕДИНИТЬ ВСЕ, так как
			// возможна ситуация, когда один курс прикреплен, как основной
			// и как вспомогательный материал (ресурс). Тогда обе выборки будут выбирать
			// одни данные два раза. 
			
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + 
			"ВЫБРАТЬ
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Период КАК Дата,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Результат,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ВыставляетсяОценка,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверяетсяПреподавателем,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверенПреподавателем,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ДатаНачалаПрохождения,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ДатаОкончанияПрохождения,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Регистратор КАК СессияВыполненияТеста,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания.Наименование КАК НаименованиеЭлементаСодержания,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс.Наименование КАК НаименованиеЭлектронногоРесурса
			|ИЗ
			|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
			|ГДЕ
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Пользователь = &Пользователь
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭтоТест = ИСТИНА
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткаЗавершена = ИСТИНА
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс В(&ЭлектронныеКурсы)
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.СсылкаНаОбъектСУЗ.НазначениеТестирования <> &НазначениеТестированияАнкетирование";	
		
		Запрос.УстановитьПараметр("ЭлектронныеКурсы", ПрисоединенныеЭлектронныеКурсы);
		Запрос.УстановитьПараметр("НазначениеТестированияАнкетирование", Перечисления.НазначенияТестированийСУЗ.Анкетирование);
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + 
	" УПОРЯДОЧИТЬ ПО Дата ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

Функция КоличествоЗавершенныхТестов(ПрохождениеОбучения) Экспорт
	
	ПрохожденияОбучения = Документы.ПрохождениеОбученияСУО.ПодчиненныеПрохождения(ПрохождениеОбучения);
	ПрохожденияОбучения.Добавить(ПрохождениеОбучения);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
		|ГДЕ
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения В(&ПрохожденияОбучения)
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткаЗавершена = &ПопыткаЗавершена
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭтоТест = ИСТИНА";
	
	Запрос.УстановитьПараметр("ПопыткаЗавершена", Истина);
	Запрос.УстановитьПараметр("ПрохожденияОбучения", ПрохожденияОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Количество();
	
КонецФункции

Функция КоличествоЗавершенныхЭлектронныхКурсов(ПрохождениеОбучения) Экспорт
	
	ПрохожденияОбучения = Документы.ПрохождениеОбученияСУО.ПодчиненныеПрохождения(ПрохождениеОбучения);
	ПрохожденияОбучения.Добавить(ПрохождениеОбучения);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
		|ГДЕ
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения В(&ПрохожденияОбучения)
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткаЗавершена = &ПопыткаЗавершена
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭтоТест = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ПопыткаЗавершена", Истина);
	Запрос.УстановитьПараметр("ПрохожденияОбучения", ПрохожденияОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Количество();
	
КонецФункции

//----------------------------------//

Функция ЕстьПопыткиПрохожденияИзЛичногоКабинета(Пользователь, ПрохождениеОбучения, Задание) Экспорт
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения)
		И НЕ ЗначениеЗаполнено(Задание) Тогда
		
		ВызватьИсключение НСтр("ru = 'Задание прохождения обучения не задано'");
		
	КонецЕсли;
	
	Если ПрохождениеОбучения = Неопределено Тогда
		ПрохождениеОбучения = Метаданные.ОпределяемыеТипы.ПрохождениеЭлектронногоОбучения.Тип.ПривестиЗначение(ПрохождениеОбучения);
	КонецЕсли;
	
	Если Задание = Неопределено Тогда
		Задание = Метаданные.ОпределяемыеТипы.ЗаданиеЭлектронногоОбучения.Тип.ПривестиЗначение(Задание);
	КонецЕсли;		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Регистратор
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Регистратор) <> ТИП(Документ.СессияЭлектронногоРесурсаСУЗ)
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Пользователь = &Пользователь
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Задание = &Задание";
	
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПопыткиПрохождения(Пользователь, ПрохождениеОбучения, Задание, ЭлектронныйРесурс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания КАК ЭлементСодержания,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.СсылкаНаОбъектСУЗ КАК СсылкаНаОбъектСУЗ,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Регистратор КАК ПопыткаВыполнения,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Результат КАК Результат,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверяетсяПреподавателем КАК ПроверяетсяПреподавателем,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверенПреподавателем КАК ПроверенПреподавателем,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ДатаНачалаПрохождения КАК Дата,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткаЗавершена КАК ПопыткаЗавершена,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭтоТест КАК ЭтоТест,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ВремяПрохожденияВСекундах КАК ВремяПрохожденияВСекундах,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЗавершеноВПроцентах КАК ЗавершеноВПроцентах,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ВыставляетсяОценка КАК ВыставляетсяОценка
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
		|ГДЕ
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Пользователь = &Пользователь
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Задание = &Задание
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
		
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();	
	
КонецФункции

#КонецОбласти

#КонецЕсли
